2023-10-18/d45967f391-STDY.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-05-22 Wed 17:05 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>ringbuffer学习</title>
<meta name="author" content="Yang" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../css/readtheorg.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">ringbuffer学习</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org8200e23">1. ringbuffer实现</a></li>
<li><a href="#org345927a">2. 不同模式下ringbuffer的分配</a></li>
<li><a href="#orgf17cd8f">3. 读写buffer</a></li>
<li><a href="#orge0192c6">4. 将采样信息写到ringbuffer中</a></li>
</ul>
</div>
</div>
<p>
Reference: Diving into Linux Perf Ring Buffer
</p>
<ol class="org-ol">
<li>Linux perf ring buffer 不仅仅用在传输PMU事件数据，同样也是一个基础机制用来硬件跟踪Intel PT，Arm CoreSight等；</li>
<li>早期perf工具设计只支持CPU PMU，后来扩展到支持timers，software events，如今集成了硬件trace，甚至可以和eBPF一起工作；</li>
<li>Question: How the buffer is synchronized between user space and kernel, and how to support SMP if the buffer is shared by multiple CPUs.</li>
<li>Content in the sequential sections:
<ul class="org-ul">
<li>The introduction for basic algorithm of the ring buffer;</li>
<li>The mechanism for AUX ring buffer;</li>
<li>At last, using Arm CoreSight as an example to explain how the ring buffer works with hardware trace.</li>
</ul></li>
</ol>

<div id="outline-container-org8200e23" class="outline-2">
<h2 id="org8200e23"><span class="section-number-2">1.</span> ringbuffer实现</h2>
<div class="outline-text-2" id="text-1">
<p>
基础算法
</p>
<ol class="org-ol">
<li>rb通过头尾指针进行管理；头指针由writer操作，尾指针由reader更新；通过头尾指针的巧妙操作，将内存抽象为一个环；</li>
<li>两个关键因素：包含供rb管理的控制结构的页 &amp; ringbuffer</li>
<li>前者约定称为user page； user page &amp; ring buffer通过虚拟映射区域VMA映射到连续的用户空间地址；user page映射在ring buffer之前；</li>
</ol>
<p>
控制结构定义：
</p>
<div class="org-src-container">
<pre class="src src-c">  <span style="font-weight: bold;">struct</span> <span style="font-weight: bold; text-decoration: underline;">perf_event_mmap_page</span> {
        <span style="font-weight: bold; text-decoration: underline;">__u64</span> <span style="font-weight: bold; font-style: italic;">data_head</span>; <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">head pointer</span>
        <span style="font-weight: bold; text-decoration: underline;">__u64</span> <span style="font-weight: bold; font-style: italic;">data_tail</span>; <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">tail pointer</span>
  }
</pre>
</div>
<p>
当内核开始将记录填进rb时，内核修改头指针，并存放数据；另一边，perf工具从尾端消费数据，并更新尾指针；
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">user page</th>
<th scope="col" class="org-left">ring buffer</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">⬇</td>
<td class="org-left">Data</td>
</tr>

<tr>
<td class="org-left">data_head --&gt;</td>
<td class="org-left">Data</td>
</tr>

<tr>
<td class="org-left">⬇</td>
<td class="org-left">Empty</td>
</tr>

<tr>
<td class="org-left">⬇</td>
<td class="org-left">Empty</td>
</tr>

<tr>
<td class="org-left">data_tail --&gt;</td>
<td class="org-left">Empty</td>
</tr>

<tr>
<td class="org-left">⬇</td>
<td class="org-left">Data</td>
</tr>

<tr>
<td class="org-left">⬇</td>
<td class="org-left">Data</td>
</tr>
</tbody>
</table>
<ol class="org-ol">
<li>内核对rb &amp; up空间采取延迟映射，直到perf工具访问的时候才通过VMA进行映射；</li>
<li>Kernel事件子系统通过线性线性内核虚拟地址访问rb&amp;up；perf工具通过VMA；第一次访问，缺页异常，kernel此时再将rb&amp;up pages映射进VMA；</li>
</ol>
<p>
缺页异常处理函数：
</p>
<div class="org-src-container">
<pre class="src src-c">  <span style="font-weight: bold;">struct</span> <span style="font-weight: bold; text-decoration: underline;">perf_buffer</span> {
        <span style="font-weight: bold;">struct</span> <span style="font-weight: bold; text-decoration: underline;">perf_event_mmap_page</span> *<span style="font-weight: bold; font-style: italic;">user_page</span>;
        <span style="font-weight: bold; text-decoration: underline;">void</span> *<span style="font-weight: bold; font-style: italic;">data_pages</span>[];
  }

        <span style="font-weight: bold;">static</span> <span style="font-weight: bold;">struct</span> <span style="font-weight: bold; text-decoration: underline;">page</span>* <span style="font-weight: bold;">__perf_mmap_to_page</span>(<span style="font-weight: bold;">struct</span> <span style="font-weight: bold; text-decoration: underline;">perf_buffer</span> *<span style="font-weight: bold; font-style: italic;">rb</span>, <span style="font-weight: bold; text-decoration: underline;">unsigned</span> <span style="font-weight: bold; text-decoration: underline;">long</span> <span style="font-weight: bold; font-style: italic;">pgoff</span>) {
        <span style="font-weight: bold;">if</span>(pgoff == 0) <span style="font-weight: bold;">return</span> virt_to_page(rb-&gt;user_page);
        <span style="font-weight: bold;">return</span> virt_to_page(rb-&gt;data_pages[pgoff-1]);
  }

  <span style="font-weight: bold;">static</span> <span style="font-weight: bold; text-decoration: underline;">vm_fault_t</span> <span style="font-weight: bold;">perf_mmap_fault</span>(<span style="font-weight: bold;">struct</span> <span style="font-weight: bold; text-decoration: underline;">vm_fault</span> *<span style="font-weight: bold; font-style: italic;">vmf</span>) {
        <span style="font-weight: bold;">struct</span> <span style="font-weight: bold; text-decoration: underline;">perf_event</span> *<span style="font-weight: bold; font-style: italic;">event</span> = vmf-&gt;vma-&gt;vm_file-&gt;private_data;
        <span style="font-weight: bold;">struct</span> <span style="font-weight: bold; text-decoration: underline;">perf_buffer</span> *<span style="font-weight: bold; font-style: italic;">rb</span>;
        <span style="font-weight: bold; text-decoration: underline;">vm_fault_t</span> <span style="font-weight: bold; font-style: italic;">ret</span> = VM_FAULT_SIGBUS;

        <span style="font-weight: bold;">if</span>(vmf-&gt;flags &amp; FAULT_FLAG_MKWRITE) {
              <span style="font-weight: bold;">if</span>(vmf-&gt;pgoff == 0) ret = 0;
              <span style="font-weight: bold;">return</span> ret;
        }

        rb = rcu_dereference(event-&gt;rb);

        vmf-&gt;page = perf_mmap_to_page(rb, vmf-&gt;pgoff);

        vmf-&gt;page-&gt;mapping = vmf-&gt;vma-&gt;vm_file-&gt;f_mapping;
        vmf-&gt;page-&gt;index = vmf-&gt;pgoff;

        <span style="font-weight: bold;">return</span> ret = 0;
  }
</pre>
</div>
</div>
</div>

<div id="outline-container-org345927a" class="outline-2">
<h2 id="org345927a"><span class="section-number-2">2.</span> 不同模式下ringbuffer的分配</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>perf支持的模式：线程模式(目标是特定线程)，cpu模式(目标是特定cpu)，系统模式(目标是所有cpu)</li>
<li>ringbuffer针对这些模式如何组织？</li>
</ol>

<p>
Per thread mode
</p>
<ol class="org-ol">
<li>perf命令通过--per-thread指定，ringbuffer为每个被分析的线程分配单独空间；</li>
<li>In this mode when the profiled thread is scheduled on a CPU, the events on that CPU will be enabled;</li>
<li>If the thread is scheduled out from the CPU, the events on the CPU will be disabled.</li>
<li>If the thread is migrated from one CPU to another CPU, the events will be disabled on the previous CPU and enabled on the next CPU correspondingly.</li>
<li>thread模式下，ringbuffer只需专心记录一个目标即可；不会有同一时间，多批记录；</li>
</ol>

<p>
Per CPU mode
</p>
<ol class="org-ol">
<li>-C选项指明要收集采样的CPUs列表，同一时刻可能有多批记录写道ringbuffer中；</li>
<li>每个CPU都有专门的ringbuffer；采样目标是CPUs；</li>
</ol>

<p>
System wide mode
</p>
<ol class="org-ol">
<li>默认模式，或显式指明 -a or --all-cpus</li>
<li>perf收集所有CPUs的样本；</li>
<li>每个CPU都有专门的ringbuffer；采样目标是CPUs；</li>
</ol>
</div>
</div>

<div id="outline-container-orgf17cd8f" class="outline-2">
<h2 id="orgf17cd8f"><span class="section-number-2">3.</span> 读写buffer</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>ringbuffer是典型的生产-消费者模式；</li>
<li>kernel events生产事件，perf用户层工具消费事件；</li>
<li>生产事件：
<ul class="org-ul">
<li>PMU中断handler检测到中断溢出</li>
<li>dynamic tracepoint with kprobe/uprobe</li>
<li>static tracepoint, etc</li>
</ul></li>
<li>一个样本放入到ringbuffer之后，kernel event core layer将会唤醒轮询关注此事件的线程；</li>
<li>perf会轮询事件，会被唤醒去从ringbuffer中读取事件；</li>
<li>perf在等待events的队列上睡眠，而非等待ringbuffer；</li>
<li>ringbuffer自身不提供睡眠队列；</li>
<li>kernel event core layer不仅仅唤醒基于事件的睡眠任务，还有唤醒基于整个ringbuffer的任务；</li>
<li>因为多个事件共享同一个ringbuffer，kernel core layer简单唤醒ringbuffer相关的睡眠进程；</li>
<li>kernel函数ring_buffer_wakeup()递归和ringbuffer相关的每一个事件，并将事件上的等待队列进行唤醒；</li>
</ol>
<div class="org-src-container">
<pre class="src src-c">  <span style="font-weight: bold;">static</span> <span style="font-weight: bold; text-decoration: underline;">void</span> <span style="font-weight: bold;">ring_buffer_wakeup</span>(<span style="font-weight: bold;">struct</span> <span style="font-weight: bold; text-decoration: underline;">perf_event</span> *<span style="font-weight: bold; font-style: italic;">event</span>)
  {
        <span style="font-weight: bold;">struct</span> <span style="font-weight: bold; text-decoration: underline;">perf_buffer</span> *<span style="font-weight: bold; font-style: italic;">rb</span>;

        rb = rcu_dereference(event-&gt;rb);
        <span style="font-weight: bold;">if</span> (rb) {
              list_for_each_entry_rcu(event, &amp;rb-&gt;event_list, rb_entry)
                    wake_up_all(&amp;event-&gt;waitq);
        }
  }
</pre>
</div>
<ol class="org-ol">
<li>Perf 是一个单线程任务；唤醒后，一个接一个检测ringbuffer；如果找到有ringbuffer包含采样信息，读出来，进行统计；</li>
<li>perf进程可以运行在任何CPUs上；这导致ringbuffer可以被多个CPUs同时访问，会导致竞争；</li>
</ol>
</div>
</div>

<div id="outline-container-orge0192c6" class="outline-2">
<h2 id="orge0192c6"><span class="section-number-2">4.</span> 将采样信息写到ringbuffer中</h2>
<div class="outline-text-2" id="text-4">
<p>
当event counter溢出时，采样信息被拿出并保存进ringbuffer；
</p>
<div class="org-src-container">
<pre class="src src-c">  <span style="font-weight: bold;">static</span> <span style="font-weight: bold; text-decoration: underline;">__always_inline</span> <span style="font-weight: bold; text-decoration: underline;">int</span>
  __perf_event_output(<span style="font-weight: bold;">struct</span> <span style="font-weight: bold; text-decoration: underline;">perf_event</span> *<span style="font-weight: bold; font-style: italic;">event</span>,
                      <span style="font-weight: bold;">struct</span> <span style="font-weight: bold; text-decoration: underline;">perf_sample_data</span> *<span style="font-weight: bold; font-style: italic;">data</span>,
                      <span style="font-weight: bold;">struct</span> <span style="font-weight: bold; text-decoration: underline;">pt_regs</span> *<span style="font-weight: bold; font-style: italic;">regs</span>,
                      <span style="font-weight: bold; text-decoration: underline;">int</span> (*<span style="font-weight: bold;">output_begin</span>)(<span style="font-weight: bold;">struct</span> <span style="font-weight: bold; text-decoration: underline;">perf_output_handle</span> *,
                                          <span style="font-weight: bold;">struct</span> <span style="font-weight: bold; text-decoration: underline;">perf_sample_data</span> *,
                                          <span style="font-weight: bold;">struct</span> <span style="font-weight: bold; text-decoration: underline;">perf_event</span> *,
                                          <span style="font-weight: bold; text-decoration: underline;">unsigned</span> <span style="font-weight: bold; text-decoration: underline;">int</span>))
  {
        <span style="font-weight: bold;">struct</span> <span style="font-weight: bold; text-decoration: underline;">perf_output_handle</span> <span style="font-weight: bold; font-style: italic;">handle</span>;
        <span style="font-weight: bold;">struct</span> <span style="font-weight: bold; text-decoration: underline;">perf_event_header</span> <span style="font-weight: bold; font-style: italic;">header</span>;
        <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">err</span>;

        <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">&#26681;&#25454;&#37319;&#26679;&#31867;&#22411;&#65292;&#20934;&#22791;&#37319;&#26679;&#22495;</span>
        perf_prepare_sample(&amp;header, data, event, regs);

        <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">&#19968;&#20010;&#20989;&#25968;&#25351;&#38024;&#65292;&#26681;&#25454;&#19981;&#21516;&#30340;&#20889;&#26041;&#21521;&#65292;&#21160;&#24577;&#20256;&#36755;&#65307;&#30446;&#30340;&#26159;&#20934;&#22791;&#20889;ringbuffer&#30340;&#20449;&#24687;&#65307;&#20449;&#24687;&#20250;&#34987;&#23384;&#25918;&#22312;handle&#20013;</span>
        err = output_begin(&amp;handle, data, event, header.size);

        <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">&#23558;&#37319;&#26679;&#22495;&#25918;&#21040;ringbuffer&#20013;</span>
        perf_output_sample(&amp;handle, &amp;header, data, event);

        <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">&#20462;&#25913;user_page&#30340;&#22836;&#25351;&#38024;</span>
        perf_output_end(&amp;handle);

        <span style="font-weight: bold;">return</span> err;
  }
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Yang</p>
<p class="date">Created: 2024-05-22 Wed 17:05</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
